/**
 * Задание 1. Вывести на экран “Hello world!”
 * **/

#include <stdio.h>

int main() {
    printf("Hello World!");
    return 0;
}