/**
 * Задание 2. Вывести на экран текст "лесенкой"
 * Let’s
 *   go
 *     to walk
 * **/

#include <stdio.h>

int main() {
    printf("Let's\n\tgo\n\t\tto walk\n");
    return 0;
}